// See https://aka.ms/new-console-template for more information
using ConsoleApp7;


class Program
{
    static void Main()
    {
        Дорога дорога = new Дорога(10, 3, 2);
        Транспортний_засіб автомобіль = new Транспортний_засіб("автомобіль", 60, 2);
        Транспортний_засіб автобус = new Транспортний_засіб("автобус", 40, 3);

        // Змінюємо рівень трафіку на дорозі
        дорога.РівеньТрафіку = 60;

        // Імітуємо рух транспорту на дорозі
        Модель_руху.РухТранспорту(дорога, автомобіль);
        Модель_руху.РухТранспорту(дорога, автобус);
    }
}